Descriptor:
  Name: Users Investigations
  DisplayName: Users Investigations
  Description: Skills to investigate users and monitor suspicious events related to identities
 
SkillGroups:

  - Format: KQL
    Skills:

      - Name: GetSigninEventLocationsSummary
        DisplayName: Get the number of signins events by location for all users
        Description: Get the number of signins events by location for all users
        DescriptionForModel : Get the number of signins events by location  for all users in the specified timeframe with the related result.
          This function returns a list of locations, result types (codes) and result signatures (success or failure) with the number of events for each of these combinations.
          It is possible to specify as input which locations and result types should be ignored (so should not be counted) or what result types shoud be considered.
          Result type 0 and success are equivalent. 
          Select this skill whenever the prompt requests for a list of signin locations.
        ExaamplePrompt:
          - "List me the signin locations of yesterday"
          - "Get the locations with successful signins during the last hour"
          - "Fetch the locations with result type 50074 and 50076 occurred today"
        Inputs:
          - Name: startDateTime
            Description: The first date and time of the considered time frame. 
            Required: true
          - Name: endDateTime
            Description: The end date and time of the considered time frame. 
            Required: true
          - Name: ignoreLocations
            Description: (Optional) Comma separated list of Locations to be ignored. 
            Required: false
          - Name: ignoreResultTypes
            Description: (Optional) Comma separated list of ResultTypes to be ignored. To get the list of possible ResultTypes (error codes), 
                         please refer to https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes (do not include the ADSTS prefix)
            Required: false
          - Name: considerOnlyResultTypes
            Description: (Optional) Comma separated list of ResultTypes to be considered. To get the list of possible ResultTypes (error codes), 
                         please refer to https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes (do not include the ADSTS prefix)
            Required: false
        Settings:
          Target: Defender
          Template: |-
            let startDateTime = datetime('{{startDateTime}}');
            let endDateTime = datetime('{{endDateTime}}');
            let ignoreLocations = split(tolower('{{ignoreLocations}}'), ',');
            let ignoreResultTypes = split('{{ignoreResultTypes}}', ',');
            let considerOnlyResultTypes = split('{{considerOnlyResultTypes}}', ',');
            SigninLogs
            | where TimeGenerated between (startDateTime .. endDateTime)
            | where UserPrincipalName contains "@"
            | where tolower(Location) !in (ignoreLocations)
            | where ResultType !in (ignoreResultTypes)
            | where (strlen(tostring(considerOnlyResultTypes))==4) or ResultType in (considerOnlyResultTypes)
            | summarize SigninEventCount = count() by Location, ResultType, ResultSignature
            | order by SigninEventCount desc     

      - Name: GetSigninEventLocationsSummaryByUsers
        DisplayName: Get the number of signins events by location for the specified users with minimal info in output
        Description: Get the number of signins events by location for the specified users with minimal info in output
        DescriptionForModel : Get the number of signins by location in the specifiedTimeframe for the specified users with minimal info in output.
          For each of the users specified in input, this function returns a list of locations, result types (codes) and result signatures (success or failure) 
          with the number of events for each of these combinations.
          It is possible to specify as input which locations and result types should be ignored (so should not be counted) or what result types shoud be considered.
          Result type 0 and success are equivalent. 
          Select this skill whenever the prompt requests for a list of signin locations for a set of users.
        ExaamplePrompt:
          - "List me the signin locations of yesterday for the users john@contoso.com and rick@contoso.com"
          - "Get the locations with successful signins during the last hour for the users john@contoso.com and rick@contoso.com"
          - "Fetch the locations with result type 50074 and 50076 occurred today for the users john@contoso.com and rick@contoso.com"        
        Inputs:
          - Name: userUpns
            Description: Comma separated list of UserPrincipalName of the users of interest
            Required: true
          - Name: startDateTime
            Description: The first date and time of the considered time frame. 
            Required: true
          - Name: endDateTime
            Description: The end date and time of the considered time frame. 
            Required: true
          - Name: ignoreLocations
            Description: (Optional) Comma separated list of Locations to be ignored. 
            Required: false
          - Name: ignoreResultTypes
            Description: (Optional) Comma separated list of ResultTypes to be ignored. To get the list of possible ResultTypes (error codes), 
                         please refer to https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes (do not include the ADSTS prefix).
            Required: false
          - Name: considerOnlyResultTypes
            Description: (Optional) Comma separated list of ResultTypes to be considered. To get the list of possible ResultTypes (error codes), 
                         please refer to https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes (do not include the ADSTS prefix)
            Required: false
        Settings:
          Target: Defender
          Template: |-
            let startDateTime = datetime('{{startDateTime}}');
            let endDateTime = datetime('{{endDateTime}}');
            let userUpns = split(tolower('{{userUpns}}'), ',');
            let ignoreLocations = split(tolower('{{ignoreLocations}}'), ',');
            let ignoreResultTypes = split('{{ignoreResultTypes}}', ',');
            let considerOnlyResultTypes = split('{{considerOnlyResultTypes}}', ',');
            SigninLogs
            | where tolower(UserPrincipalName) in (userUpns)
            | where TimeGenerated between (startDateTime .. endDateTime)
            | where tolower(Location) !in (ignoreLocations)
            | where ResultType !in (ignoreResultTypes)
            | where (strlen(tostring(considerOnlyResultTypes))==4) or ResultType in (considerOnlyResultTypes)
            | summarize SigninEventCount = count() by UserPrincipalName, Location, ResultType, ResultSignature
            | order by SigninEventCount desc 

      - Name: GetSigninEventDetailsSummaryByUsers
        DisplayName: Get the number of signins events summarized by different details for the specified users 
        Description: Get the number of signins events summarized by different details for the specified users
        DescriptionForModel : Get the number of signins in the specifiedTimeframe for the specified users, summarized by Location, ResultType, ResultSignature, 
          ResultDescription, City, ClientAppUsed and AppDisplayName.
          For each of the users specified in input, this function returns a list of locations, result types (codes) and result signatures (success or failure),
          result description (explaination of the result type), city of signin, client app used and cloud app requested, with the number of events for each of these combinations.
          It is possible to specify as input which locations and result types should be ignored (so should not be counted) or what result types shoud be considered.
          Result type 0 and success are equivalent. 
          Select this skill whenever the prompt requests for a list of signin locations and additional details (like client app, target app) for a set of users.
        ExaamplePrompt:
          - "List me the signin locations of yesterday for the users john@contoso.com and rick@contoso.com. Explain the results"
          - "Get the locations with successful signins during the last hour for the users john@contoso.com and rick@contoso.com. Include the target apps."
          - "Fetch the locations with result type 50074 and 50076 occurred today for the users john@contoso.com and rick@contoso.com. Specify the client apps and the target apps."              
        Inputs:
          - Name: userUpns
            Description: Comma separated list of UserPrincipalName of the users of interest
            Required: true
          - Name: startDateTime
            Description: The first date and time of the considered time frame. 
            Required: true
          - Name: endDateTime
            Description: The end date and time of the considered time frame. 
            Required: true
          - Name: ignoreLocations
            Description: (Optional) Comma separated list of Locations to be ignored. 
            Required: false
          - Name: ignoreResultTypes
            Description: (Optional) Comma separated list of ResultTypes to be ignored. To get the list of possible ResultTypes (error codes), 
                         please refer to https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes (do not include the ADSTS prefix)
            Required: false
          - Name: considerOnlyResultTypes
            Description: (Optional) Comma separated list of ResultTypes to be considered. To get the list of possible ResultTypes (error codes), 
                         please refer to https://learn.microsoft.com/en-us/entra/identity-platform/reference-error-codes#aadsts-error-codes (do not include the ADSTS prefix)
            Required: false
        Settings:
          Target: Defender
          Template: |-
            let startDateTime = datetime('{{startDateTime}}');
            let endDateTime = datetime('{{endDateTime}}');
            let userUpns = split(tolower('{{userUpns}}'), ',');
            let ignoreLocations = split(tolower('{{ignoreLocations}}'), ',');
            let ignoreResultTypes = split('{{ignoreResultTypes}}', ',');
            let considerOnlyResultTypes = split('{{considerOnlyResultTypes}}', ',');
            SigninLogs
            | where tolower(UserPrincipalName) in (userUpns)
            | where TimeGenerated between (startDateTime .. endDateTime)
            | where tolower(Location) !in (ignoreLocations)
            | where ResultType !in (ignoreResultTypes)
            | where (strlen(tostring(considerOnlyResultTypes))==4) or ResultType in (considerOnlyResultTypes)
            | extend City = tostring(parse_json(LocationDetails).city)       
            | summarize SigninEventCount = count() by UserPrincipalName, Location, ResultType, ResultSignature, ResultDescription, City, ClientAppUsed, AppDisplayName
            | order by SigninEventCount desc 
