Descriptor:
  Name: Sample plugin for support case
  DisplayName: Sample plugin for support case
  Description: Skills in sample plugin for support case 
SkillGroups:
  - Format: KQL
    Skills:
      - Name: GetSigninLocationsSummary
        DisplayName: Get the number of signins events by location for the specified users 
        Description: Get the number of signins events by location for the specified users 
        DescriptionForModel : Get the number of signins events by location for the specified users 
        Inputs:
          - Name: userUpns
            Description: Comma separated list of UserPrincipalName of the users of interest
            Required: true
          - Name: startDateTime
            Description: (Optional) The first date and time of the considered time frame. If startDateTime and endDateTime are not both specified, the query is done on the last 24 hours.
            Required: false
          - Name: endDateTime
            Description: (Optional) The end date and time of the considered time frame. If startDateTime and endDateTime are not both specified, the query is done on the last 24 hours.
            Required: false
        Settings:
          Target: Defender
          Template: |-
            let userUpns = split(tolower({{userUpns}}), ',');
            let startDateTime = iff(isnull({{startDateTime}}) or {{startDateTime}} == '', now(-1d), datetime({{startDateTime}}));
            let endDateTime = iff(isnull({{endDateTime}}) or {{endDateTime}} == '', now(), datetime({{endDateTime}}));
            SigninLogs
            | where tolower(UserPrincipalName) in (userUpns)
            | where TimeGenerated between (startDateTime .. endDateTime)
            | summarize SigninEventCount = count() by Location, ResultType, ResultSignature, ResultDescription
            | order by SigninEventCount desc     
